NO_DATA = 'Нет данных'

# parser
LINK_TEMPLATE = r'https://e-disclosure.ru/portal/event.aspx\?EventId=[a-zA-Z0-9-]+\-[a-zA-Z0-9-]\-[a-zA-Z0-9-]'
SUBTITLE = 'Решения общих собраний участников (акционеров)'
TEXT_START = 'Общие сведения'
TEXT_END = 'Настоящее сообщение предоставлено'

# a.
FULL_NAME_ID = 1
SHORT_NAME_ID = 2

# b.
ADDRESS_ID = 3
INN_ID = 5
OGRN_ID = 4

# c.
DATE_ID = 8
FORM = 'форма проведения'

# d.
AUDITOR_VARIANTS = [
    'утвердить в качестве аудитор',
    'утвердить аудитор',
    'утверждение аудитор',
]

# e.
DIRECTORS_VARIANTS = [
    'избрать совет директоров',
    'избрать в совет директоров',
    'избрать членами совета',
    'избрать членов совета',
    'избрать состав совета',
    'избрать в состав совета'
]
CLOSED_INFO = 'Информация не раскрывается на основании Постановления Правительства РФ от 04.04.2019 №400 и ' \
              'решения Совета Директоров АО «СМПП» об ограничении раскрытия и предоставления информации, ' \
              'принятого 28.06.2019 г. (Протокол № 1 от 28.06.2019 г.).'

# f.
DIV_NOT = 'Принято решение не выплачивать дивиденды'
DIV_OK = 'Принято решение выплатить дивиденды'
DIV_404 = 'Вопрос не поднимался'
